namespace EcoPulseBackend.Enums;

/// <summary>
/// Загрязняющее вещество
/// </summary>
public enum Pollutant
{
    /// <summary>
    /// Углерода оксид (углерод окись; углерод моноокись; угарный газ)
    /// </summary>
    CO = 337,
    
    /// <summary>
    /// Бензин (нефтяной, малосернистый) /в пересчете на углерод/
    /// </summary>
    CH = 2704,
    
    /// <summary>
    /// Азота диоксид (двуокись азота; пероксид азота)
    /// </summary>
    NO2 = 301,
    
    /// <summary>
    /// Азота оксид (азот (II) оксид; азот монооксид)
    /// </summary>
    NO = 304,
    
    /// <summary>
    /// Серы диоксид
    /// </summary>
    SO2 = 330,
    
    /// <summary>
    /// Углеводороды предельные C12 - C19 (растворители РПК-240, РПК-280)
    /// </summary>
    RPK240280 = 2754,
    
    /// <summary>
    /// Сероводород (дигидросульфид; водород сернистый; гидросульфид)
    /// </summary>
    H2S = 333,
    
    /// <summary>
    /// диЖелезо триоксид (железа оксид; железо сесквиоксид) /в пересчете на железо/
    /// </summary>
    Fe2O3 = 123,
    
    /// <summary>
    /// Марганец и его соединения /в пересчете на марганец (IV) оксид/
    /// </summary>
    MnO2 = 143,
    
    /// <summary>
    /// Фториды газообразные /в пересчете на фтор/: гидрофторид (водород фторид, фторводород); кремний тетрафторид
    /// </summary>
    FluorideGases = 342,
    
    /// <summary>
    /// Углексилый газ
    /// </summary>
    CO2 = 380,
    
    /// <summary>
    /// Твердые частицы
    /// </summary>
    SP = 2,
    
    /// <summary>
    /// Сажа 
    /// </summary>
    Soot = 328,
    
    /// <summary>
    /// Керосин
    /// </summary>
    Kerosene = 2732,
    
    /// <summary>
    /// Формальдегид
    /// </summary>
    CH2O = 1325,
    
    /// <summary>
    /// Бенз(а)пирен
    /// </summary>
    C20H12 = 703,
    
    /// <summary>
    /// Соединения свинца
    /// </summary>
    LeadCompounds = 184,
    
    /// <summary>
    /// Пыль каменного угля
    /// </summary>
    CoalDust = 3749
}